Revit 2025 API
Result Enumeration
Informs Autodesk Revit of the status of your application after execution.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum Result
Public Enumeration Result
public enum class Result
type Result
Members
Member name | Value | Description
Succeeded | 0 | The external application completed successfully. Autodesk Revit will keep this object during the entire Revit session.
Cancelled | 1 | Signifies that the external application is cancelled.
Failed | -1 | The external application was unable to complete its task.
See Also
Reference
Autodesk.Revit.UI Namespace